occam25/STM32L4_bluetooth_sensor/Src/sensor_service.c

#include "sensor_service.h"
#include "bluenrg_gap_aci.h"
#include "bluenrg_gatt_aci.h"
#include "bme280_driver.h"

#include "stm32l4xx_nucleo.h"


__IO uint32_t connected = FALSE;
__IO uint8_t set_connectable = 1;
__IO uint16_t connection_handle = 0;
__IO uint8_t notification_enabled = FALSE;
uint16_t sampleServHandle, TXCharHandle, RXCharHandle;
uint16_t envSensServHandle, tempCharHandle, pressCharHandle, humidityCharHandle, thresholdCharHandle, alarmCharHandle;

#define COPY_UUID_128(uuid_struct, uuid_15, uuid_14, uuid_13, uuid_12, uuid_11, uuid_10, uuid_9, uuid_8, uuid_7, uuid_6, uuid_5, uuid_4, uuid_3, uuid_2, uuid_1, uuid_0) \
do {\
	uuid_struct[0] = uuid_0; uuid_struct[1] = uuid_1; uuid_struct[2] = uuid_2; uuid_struct[3] = uuid_3; \
	uuid_struct[4] = uuid_4; uuid_struct[5] = uuid_5; uuid_struct[6] = uuid_6; uuid_struct[7] = uuid_7; \
	uuid_struct[8] = uuid_8; uuid_struct[9] = uuid_9; uuid_struct[10] = uuid_10; uuid_struct[11] = uuid_11; \
	uuid_struct[12] = uuid_12; uuid_struct[13] = uuid_13; uuid_struct[14] = uuid_14; uuid_struct[15] = uuid_15; \
}while(0)

#define COPY_ENV_SENS_SERVICE_UUID(uuid_struct)  COPY_UUID_128(uuid_struct,0x42,0x82,0x1a,0x40, 0xe4,0x77, 0x11,0xe2, 0x82,0xd0, 0x00,0x02,0xa5,0xd5,0xc5,0x1b)
#define COPY_TEMP_CHAR_UUID(uuid_struct)         COPY_UUID_128(uuid_struct,0xa3,0x2e,0x55,0x20, 0xe4,0x77, 0x11,0xe2, 0xa9,0xe3, 0x00,0x02,0xa5,0xd5,0xc5,0x1b)
#define COPY_PRESS_CHAR_UUID(uuid_struct)        COPY_UUID_128(uuid_struct,0xcd,0x20,0xc4,0x80, 0xe4,0x8b, 0x11,0xe2, 0x84,0x0b, 0x00,0x02,0xa5,0xd5,0xc5,0x1b)
#define COPY_HUMIDITY_CHAR_UUID(uuid_struct)     COPY_UUID_128(uuid_struct,0x01,0xc5,0x0b,0x60, 0xe4,0x8c, 0x11,0xe2, 0xa0,0x73, 0x00,0x02,0xa5,0xd5,0xc5,0x1b)
#define COPY_THRESHOLD_CHAR_UUID(uuid_struct)  	 COPY_UUID_128(uuid_struct,0x03,0xc6,0x0c,0x61, 0xe4,0x8d, 0x11,0xe2, 0xa1,0x74, 0x00,0x02,0xa5,0xd5,0xc5,0x1b)
#define COPY_ALARM_CHAR_UUID(uuid_struct)  	 	 COPY_UUID_128(uuid_struct,0x04,0xc7,0x0d,0x62, 0xe4,0x8e, 0x11,0xe2, 0xa2,0x75, 0x00,0x02,0xa5,0xd5,0xc5,0x1b)

/* Store Value into a buffer in Little Endian Format */
#define STORE_LE_16(buf, val)    ( ((buf)[0] =  (uint8_t) (val)    ) , \
                                   ((buf)[1] =  (uint8_t) (val>>8) ) )


static uint16_t temp_alarm = 0;
static uint16_t temp_threshold = 30;

/**
 * @brief  Add the Environmental Sensor service.
 *
 * @param  None
 * @retval Status
 */
tBleStatus Add_Environmental_Sensor_Service(void)
{
  tBleStatus ret;
  uint8_t uuid[16];
  uint16_t uuid16;
  charactFormat charFormat;
  uint16_t descHandle;
  
  COPY_ENV_SENS_SERVICE_UUID(uuid);
  ret = aci_gatt_add_serv(UUID_TYPE_128,  uuid, PRIMARY_SERVICE, 20,
                          &envSensServHandle);
  if (ret != BLE_STATUS_SUCCESS) goto fail;
  
  /* Temperature Characteristic */
  COPY_TEMP_CHAR_UUID(uuid);  
  ret =  aci_gatt_add_char(envSensServHandle, UUID_TYPE_128, uuid, 2,
                           CHAR_PROP_READ, ATTR_PERMISSION_NONE,
                           GATT_NOTIFY_READ_REQ_AND_WAIT_FOR_APPL_RESP,
                           16, 0, &tempCharHandle);
  if (ret != BLE_STATUS_SUCCESS) goto fail;
  
  charFormat.format = FORMAT_SINT16;
  charFormat.exp = -1;
  charFormat.unit = UNIT_TEMP_CELSIUS;
  charFormat.name_space = 0;
  charFormat.desc = 0;
  
  uuid16 = CHAR_FORMAT_DESC_UUID;
  
  ret = aci_gatt_add_char_desc(envSensServHandle,
                               tempCharHandle,
                               UUID_TYPE_16,
                               (uint8_t *)&uuid16, 
                               7,
                               7,
                               (void *)&charFormat, 
                               ATTR_PERMISSION_NONE,
                               ATTR_ACCESS_READ_ONLY,
                               0,
                               16,
                               FALSE,
                               &descHandle);
  if (ret != BLE_STATUS_SUCCESS) goto fail;
  
  /* Pressure Characteristic */

	COPY_PRESS_CHAR_UUID(uuid);
	ret =  aci_gatt_add_char(envSensServHandle, UUID_TYPE_128, uuid,
							 3,
							 CHAR_PROP_READ, ATTR_PERMISSION_NONE,
							 GATT_NOTIFY_READ_REQ_AND_WAIT_FOR_APPL_RESP,
							 16, 0, &pressCharHandle);
	if (ret != BLE_STATUS_SUCCESS) goto fail;

	charFormat.format = FORMAT_SINT24;
	charFormat.exp = -5;
	charFormat.unit = UNIT_PRESSURE_BAR;
	charFormat.name_space = 0;
	charFormat.desc = 0;

	uuid16 = CHAR_FORMAT_DESC_UUID;

	ret = aci_gatt_add_char_desc(envSensServHandle,
								 pressCharHandle,
								 UUID_TYPE_16,
								 (uint8_t *)&uuid16,
								 7,
								 7,
								 (void *)&charFormat,
								 ATTR_PERMISSION_NONE,
								 ATTR_ACCESS_READ_ONLY,
								 0,
								 16,
								 FALSE,
								 &descHandle);
	if (ret != BLE_STATUS_SUCCESS) goto fail;

  /* Humidity Characteristic */
	COPY_HUMIDITY_CHAR_UUID(uuid);
	ret =  aci_gatt_add_char(envSensServHandle, UUID_TYPE_128, uuid, 2,
							 CHAR_PROP_READ, ATTR_PERMISSION_NONE,
							 GATT_NOTIFY_READ_REQ_AND_WAIT_FOR_APPL_RESP,
							 16, 0, &humidityCharHandle);
	if (ret != BLE_STATUS_SUCCESS) goto fail;

	charFormat.format = FORMAT_UINT16;
	charFormat.exp = -1;
	charFormat.unit = UNIT_UNITLESS;
	charFormat.name_space = 0;
	charFormat.desc = 0;

	uuid16 = CHAR_FORMAT_DESC_UUID;

	ret = aci_gatt_add_char_desc(envSensServHandle,
								 humidityCharHandle,
								 UUID_TYPE_16,
								 (uint8_t *)&uuid16,
								 7,
								 7,
								 (void *)&charFormat,
								 ATTR_PERMISSION_NONE,
								 ATTR_ACCESS_READ_ONLY,
								 0,
								 16,
								 FALSE,
								 &descHandle);
	if (ret != BLE_STATUS_SUCCESS) goto fail;


  /* Threshold Characteristic */
	COPY_THRESHOLD_CHAR_UUID(uuid);
	ret =  aci_gatt_add_char(envSensServHandle,
							 UUID_TYPE_128,
							 uuid,
							 2,
							 CHAR_PROP_READ | CHAR_PROP_WRITE |
							 CHAR_PROP_WRITE_WITHOUT_RESP,
							 ATTR_PERMISSION_NONE,
							 GATT_NOTIFY_READ_REQ_AND_WAIT_FOR_APPL_RESP |
							 GATT_NOTIFY_WRITE_REQ_AND_WAIT_FOR_APPL_RESP |
							 GATT_NOTIFY_ATTRIBUTE_WRITE,
							 16,
							 0,
							 &thresholdCharHandle);
	if (ret != BLE_STATUS_SUCCESS) goto fail;

	charFormat.format = FORMAT_UINT16;
	charFormat.exp = -1;
	charFormat.unit = UNIT_UNITLESS;
	charFormat.name_space = 0;
	charFormat.desc = 0;

	uuid16 = CHAR_FORMAT_DESC_UUID;

	ret = aci_gatt_add_char_desc(envSensServHandle,
								 thresholdCharHandle,
								 UUID_TYPE_16,
								 (uint8_t *)&uuid16,
								 7,
								 7,
								 (void *)&charFormat,
								 ATTR_PERMISSION_NONE,
								 ATTR_PERMISSION_NONE,
								 ATTR_ACCESS_READ_WRITE,
								 16,
								 FALSE,
								 &descHandle);
	if (ret != BLE_STATUS_SUCCESS) goto fail;

    /* Alarm Characteristic */
	COPY_ALARM_CHAR_UUID(uuid);
	ret =  aci_gatt_add_char(envSensServHandle, UUID_TYPE_128, uuid, 2,
							 CHAR_PROP_READ, ATTR_PERMISSION_NONE,
							 GATT_NOTIFY_READ_REQ_AND_WAIT_FOR_APPL_RESP,
							 16, 0, &alarmCharHandle);
	if (ret != BLE_STATUS_SUCCESS) goto fail;

	charFormat.format = FORMAT_UINT16;
	charFormat.exp = -1;
	charFormat.unit = UNIT_UNITLESS;
	charFormat.name_space = 0;
	charFormat.desc = 0;

	uuid16 = CHAR_FORMAT_DESC_UUID;

	ret = aci_gatt_add_char_desc(envSensServHandle,
								 alarmCharHandle,
								 UUID_TYPE_16,
								 (uint8_t *)&uuid16,
								 7,
								 7,
								 (void *)&charFormat,
								 ATTR_PERMISSION_NONE,
								 ATTR_ACCESS_READ_ONLY,
								 0,
								 16,
								 FALSE,
								 &descHandle);
	if (ret != BLE_STATUS_SUCCESS) goto fail;


  PRINTF("Service ENV_SENS added. Handle 0x%04X, TEMP Charac handle: 0x%04X, PRESS Charac handle: 0x%04X, HUMID Charac handle: 0x%04X LED Charac handle: 0x%04X\n",
		  envSensServHandle, tempCharHandle, pressCharHandle, humidityCharHandle, thresholdCharHandle);

  return BLE_STATUS_SUCCESS; 
  
fail:
  PRINTF("Error while adding ENV_SENS service.\n");
  return BLE_STATUS_ERROR ;
  
}

/**
 * @brief  Update temperature characteristic value.
 * @param  Temperature in tenths of degree 
 * @retval Status
 */
tBleStatus Temp_Update(int16_t temp)
{  
  tBleStatus ret;
  
  ret = aci_gatt_update_char_value(envSensServHandle, tempCharHandle, 0, 2,
                                   (uint8_t*)&temp);
  
  if (ret != BLE_STATUS_SUCCESS){
    PRINTF("Error while updating TEMP characteristic.\n") ;
    return BLE_STATUS_ERROR ;
  }
  return BLE_STATUS_SUCCESS;
	
}


/**
 * @brief  Update temperature alarm characteristic value.
 * @param  Temperature alarm
 * @retval Status
 */
tBleStatus Temp_Alarm_Update(int16_t temp_alarm)
{
  tBleStatus ret;

  ret = aci_gatt_update_char_value(envSensServHandle, alarmCharHandle, 0, 2,
                                   (uint8_t*)&temp_alarm);

  if (ret != BLE_STATUS_SUCCESS){
    PRINTF("Error while updating TEMP ALARM characteristic.\n") ;
    return BLE_STATUS_ERROR ;
  }
  return BLE_STATUS_SUCCESS;

}


/**
 * @brief  Update temperature threshold characteristic value.
 * @param  Temperature threshold
 * @retval Status
 */
tBleStatus Temp_Threshold_Update(int16_t temp_threshold)
{
  tBleStatus ret;

  ret = aci_gatt_update_char_value(envSensServHandle, thresholdCharHandle, 0, 2,
                                   (uint8_t*)&temp_threshold);

  if (ret != BLE_STATUS_SUCCESS){
    PRINTF("Error while updating TEMP THRESHOLD characteristic.\n") ;
    return BLE_STATUS_ERROR ;
  }
  return BLE_STATUS_SUCCESS;

}

/**
 * @brief  Update pressure characteristic value.
 * @param  int32_t Pressure in mbar 
 * @retval tBleStatus Status
 */
tBleStatus Press_Update(int32_t press)
{  
  tBleStatus ret;
  
  ret = aci_gatt_update_char_value(envSensServHandle, pressCharHandle, 0, 3,
                                   (uint8_t*)&press);
  
  if (ret != BLE_STATUS_SUCCESS){
    PRINTF("Error while updating TEMP characteristic.\n") ;
    return BLE_STATUS_ERROR ;
  }
  return BLE_STATUS_SUCCESS;
	
}

/**
 * @brief  Update humidity characteristic value.
 * @param  uint16_thumidity RH (Relative Humidity) in tenths of %
 * @retval tBleStatus      Status
 */
tBleStatus Humidity_Update(uint16_t humidity)
{  
  tBleStatus ret;
  
  ret = aci_gatt_update_char_value(envSensServHandle, humidityCharHandle, 0, 2,
                                   (uint8_t*)&humidity);
  
  if (ret != BLE_STATUS_SUCCESS){
    PRINTF("Error while updating TEMP characteristic.\n") ;
    return BLE_STATUS_ERROR ;
  }
  return BLE_STATUS_SUCCESS;
  
}

/**
 * @brief  Puts the device in connectable mode.
 *         If you want to specify a UUID list in the advertising data, those data can
 *         be specified as a parameter in aci_gap_set_discoverable().
 *         For manufacture data, aci_gap_update_adv_data must be called.
 * @param  None 
 * @retval None
 */
/* Ex.:
 *
 *  tBleStatus ret;    
 *  const char local_name[] = {AD_TYPE_COMPLETE_LOCAL_NAME,'B','l','u','e','N','R','G'};    
 *  const uint8_t serviceUUIDList[] = {AD_TYPE_16_BIT_SERV_UUID,0x34,0x12};    
 *  const uint8_t manuf_data[] = {4, AD_TYPE_MANUFACTURER_SPECIFIC_DATA, 0x05, 0x02, 0x01};
 *  
 *  ret = aci_gap_set_discoverable(ADV_DATA_TYPE, ADV_INTERV_MIN, ADV_INTERV_MAX, PUBLIC_ADDR, 
 *                                 NO_WHITE_LIST_USE, 8, sizeof(local_name), 3, serviceUUIDList, 0, 0);    
 *  ret = aci_gap_update_adv_data(5, manuf_data);
 *
 */
void setConnectable(void)
{  
  tBleStatus ret;
  
  const char local_name[] = {AD_TYPE_COMPLETE_LOCAL_NAME,'I','o','T','-','T','h','e','r','m'};
  
  /* disable scan response */
  hci_le_set_scan_resp_data(0,NULL);
  PRINTF("General Discoverable Mode.\n");
  
  ret = aci_gap_set_discoverable(ADV_DATA_TYPE, ADV_INTERV_MIN, ADV_INTERV_MAX, PUBLIC_ADDR, 
                                 NO_WHITE_LIST_USE, sizeof(local_name), local_name, 0, NULL, 0, 0);
  if (ret != BLE_STATUS_SUCCESS) {
    PRINTF("Error while setting discoverable mode (%d)\n", ret);    
  }  
}

/**
 * @brief  This function is called when there is a LE Connection Complete event.
 * @param  uint8_t Address of peer device
 * @param  uint16_t Connection handle
 * @retval None
 */
void GAP_ConnectionComplete_CB(uint8_t addr[6], uint16_t handle)
{  
  connected = TRUE;
  connection_handle = handle;
  
  PRINTF("Connected to device:");
  for(uint32_t i = 5; i > 0; i--){
    PRINTF("%02X-", addr[i]);
  }
  PRINTF("%02X\n", addr[0]);
}

/**
 * @brief  This function is called when the peer device gets disconnected.
 * @param  None 
 * @retval None
 */
void GAP_DisconnectionComplete_CB(void)
{
  connected = FALSE;
  PRINTF("Disconnected\n");
  /* Make the device connectable again. */
  set_connectable = TRUE;
  notification_enabled = FALSE;
}


void update_values(void)
{
	if(0 != bme280_data_readout()){
		HAL_GPIO_TogglePin(GPIOA, GPIO_PIN_5);
		PRINTF("BME280 sensor read failed\r\n");
		return;
	}

	if(temp >= temp_threshold){
		temp_alarm = 1;
		BSP_LED_On(LED2);
	}else{
		temp_alarm = 0;
		BSP_LED_Off(LED2);
	}

}
/**
 * @brief  Read request callback.
 * @param  uint16_t Handle of the attribute
 * @retval None
 */
void Read_Request_CB(uint16_t handle)
{  

	if(handle == tempCharHandle + 1){
		int16_t data = (int16_t)(temp*10);
		Temp_Update(data);
	}
	else if(handle == pressCharHandle + 1){
		int32_t data = (int32_t)(press*100);

		HAL_Delay(100);
		Press_Update(data);
	}
	else if(handle == humidityCharHandle + 1){
		uint16_t data = (uint16_t)(hum*10);
		Humidity_Update(data);
	}
	else if(handle == alarmCharHandle + 1){
		uint16_t data = (uint16_t)(temp_alarm);
		Temp_Alarm_Update(data);
	}
	else if(handle == thresholdCharHandle + 1){
		uint16_t data = (uint16_t)(temp_threshold);
		Temp_Threshold_Update(data);
	}

	if(connection_handle != 0)
		aci_gatt_allow_read(connection_handle);
}


void Write_Request_CB(evt_gatt_write_permit_req *pr)
{
	if(pr->attr_handle == thresholdCharHandle + 1){
		temp_threshold = pr->data[1] << 8 | pr->data[0];
		aci_gatt_write_response(pr->conn_handle, pr->attr_handle, 0, 0, pr->data_length, pr->data);
	}
}

/**
 * @brief  Callback processing the ACI events.
 * @note   Inside this function each event must be identified and correctly
 *         parsed.
 * @param  void* Pointer to the ACI packet
 * @retval None
 */
void user_notify(void * pData)
{
  hci_uart_pckt *hci_pckt = pData;
  /* obtain event packet */
  hci_event_pckt *event_pckt = (hci_event_pckt*)hci_pckt->data;
  
  if(hci_pckt->type != HCI_EVENT_PKT)
    return;
  
  switch(event_pckt->evt){
    
  case EVT_DISCONN_COMPLETE:
    {
      GAP_DisconnectionComplete_CB();
    }
    break;
    
  case EVT_LE_META_EVENT:
    {
      evt_le_meta_event *evt = (void *)event_pckt->data;
      
      switch(evt->subevent){
      case EVT_LE_CONN_COMPLETE:
        {
          evt_le_connection_complete *cc = (void *)evt->data;
          GAP_ConnectionComplete_CB(cc->peer_bdaddr, cc->handle);
        }
        break;
      }
    }
    break;
    
  case EVT_VENDOR:
	{
		evt_blue_aci *blue_evt = (void*)event_pckt->data;
		switch(blue_evt->ecode){
		case EVT_BLUE_GATT_READ_PERMIT_REQ:
		{
			evt_gatt_read_permit_req *pr = (void*)blue_evt->data;
			Read_Request_CB(pr->attr_handle);
			break;
		}
		case EVT_BLUE_GATT_WRITE_PERMIT_REQ:
		{
			evt_gatt_write_permit_req *pr = (void *)blue_evt->data;
			Write_Request_CB(pr);
			break;
		}
		}
	}
    break;
  }    
}

